Repository: jsdelivr/jsdelivr
Catalog: files/obviel/1.0b3/obviel-forms-*.po
Languages: nl

source: unknown value
nl: Ongeldige waarde

source: invalid date
nl: Ongeldige datum

source: {count} field did not validate
nl: {count} veld kon niet gevalideerd worden

source: this field is required
nl: Dit veld is verplicht

source: value too short
nl: Invoer te weinig karakters

source: value too long
nl: Invoer te veel karakters

source: not a number
nl: Geen nummer

source: not an integer number
nl: Geen geheel getal

source: negative numbers are not allowed
nl: Negatieve getallen zijn niet toegestaan

source: value must be %1 digits long
nl: De waarde moet %1 cijfers bevatten

source: not a float
nl: Veld moet numerieke waarde bevatten

source: not a decimal
nl: Veld moet numerieke waarde bevatten

source: decimal must contain at least %1 digits before the decimal mark
nl: Er zijn tenminste %1 cijfers nodig voor de komma

source: decimal may not contain more than %1 digits before the decimal mark
nl: Er zijn niet meer dan %1 cijfers toegestaan voor de komma

source: decimal must contain at least %1 digits after the decimal mark
nl: Er zijn tenminste %1 cijfers nodig na de komma

source: decimal may not contain more than %1 digits after the decimal mark
nl: Er zijn niet meer dan %1 cijfers toegestaan na de komma
